#### Terraform Format and Style 🖌 `failure` (ignored)
#### Terraform Initialization ⚙️ `success`
#### Terraform Validation 🤖 
Warning: Provider github is undefined

  on github/users.tf line 112, in module "old_aarrtthhuurr":
 112:     github = github.old

Module module.github.module.old_aarrtthhuurr does not declare a provider
named github.
If you wish to specify a provider configuration for the module, add an entry
for github in the required_providers block within the module.

(and 28 more similar warnings elsewhere)
Success! The configuration is valid, but there were some validation warnings
as shown above.


#### Terraform Plan 📖 `success`

<details><summary>Show Plan</summary>

```terraform
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.github.module.repositories.github_branch_protection.flairsou-api_master will be created
  + resource "github_branch_protection" "flairsou-api_master" {
      + enforce_admins         = false
      + id                     = (known after apply)
      + pattern                = "main"
      + push_restrictions      = [
          + "MDQ6VGVhbTQyMTc3MzM=",
        ]
      + repository_id          = (known after apply)
      + require_signed_commits = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + dismissal_restrictions          = [
              + "MDQ6VGVhbTQyMTc3MzM=",
            ]
          + require_code_owner_reviews      = true
          + required_approving_review_count = 1
        }
    }

  # module.github.module.repositories.github_project_column.flairsou-api_main_approved will be created
  + resource "github_project_column" "flairsou-api_main_approved" {
      + column_id  = (known after apply)
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "APPROVED"
      + project_id = (known after apply)
    }

  # module.github.module.repositories.github_project_column.flairsou-api_main_codeReview will be created
  + resource "github_project_column" "flairsou-api_main_codeReview" {
      + column_id  = (known after apply)
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "CODE REVIEW"
      + project_id = (known after apply)
    }

  # module.github.module.repositories.github_project_column.flairsou-api_main_doing will be created
  + resource "github_project_column" "flairsou-api_main_doing" {
      + column_id  = (known after apply)
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "DOING"
      + project_id = (known after apply)
    }

  # module.github.module.repositories.github_project_column.flairsou-api_main_done will be created
  + resource "github_project_column" "flairsou-api_main_done" {
      + column_id  = (known after apply)
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "DONE"
      + project_id = (known after apply)
    }

  # module.github.module.repositories.github_project_column.flairsou-api_main_todo will be created
  + resource "github_project_column" "flairsou-api_main_todo" {
      + column_id  = (known after apply)
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "TODO"
      + project_id = (known after apply)
    }

  # module.github.module.repositories.github_repository.flairsou-api will be created
  + resource "github_repository" "flairsou-api" {
      + allow_merge_commit     = true
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archived               = false
      + auto_init              = false
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + description            = "Outil de tresorerie associative - API"
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + has_downloads          = false
      + has_issues             = true
      + has_projects           = true
      + has_wiki               = true
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + name                   = "flairsou-api"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = "public"
      + vulnerability_alerts   = true
    }

  # module.github.module.repositories.github_repository.gesasso_mkmail will be updated in-place
  ~ resource "github_repository" "gesasso_mkmail" {
        id                     = "gesasso_mkmail"
        name                   = "gesasso_mkmail"
      ~ vulnerability_alerts   = false -> true
        # (25 unchanged attributes hidden)
    }

  # module.github.module.repositories.github_repository_project.flairsou-api_main will be created
  + resource "github_repository_project" "flairsou-api_main" {
      + body       = "Main project's tasks"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "Flairsou API Project"
      + repository = "flairsou-api"
      + url        = (known after apply)
    }

  # module.github.module.repositories.github_team_repository.flairsou_flairsou-api will be created
  + resource "github_team_repository" "flairsou_flairsou-api" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "flairsou-api"
      + team_id    = "4276153"
    }

  # module.github.module.repositories.github_team_repository.simde_flairsou-api will be created
  + resource "github_team_repository" "simde_flairsou-api" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "flairsou-api"
      + team_id    = "4217733"
    }

Plan: 10 to add, 1 to change, 0 to destroy.

Warning: Provider github is undefined

  on github/users.tf line 112, in module "old_aarrtthhuurr":
 112:     github = github.old

Module module.github.module.old_aarrtthhuurr does not declare a provider
named github.
If you wish to specify a provider configuration for the module, add an entry
for github in the required_providers block within the module.

(and 28 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @huetremy, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform CI`*